Revit 2027 API
RebarContainer.Contains Method
 Checks if the RebarContainer has this item as one of its members.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Contains(
	RebarContainerItem item
)
Public Function Contains (
	item As RebarContainerItem
) As Boolean
public:
bool Contains(
	RebarContainerItem^ item
)
member Contains :
        item : RebarContainerItem -> bool
Parameters
item RebarContainerItem
 The item to be checked if RebarContainer has it as one of its members
Return Value
Boolean
 True if RebarContainer has this item as one of its members, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace